#Copyright (c) 2020-2021 by XEPIC Technology Co., Ltd.
#ALL RIGHTS RESERVED  https://www.x-epic.com
create_power_domain PD_TOP -include_scope

create_supply_port SP1
create_supply_port SP2
create_supply_port VSS
create_supply_port SP3
create_supply_net SN1
create_supply_net SN2
create_supply_net GN1
create_supply_net SN3
create_supply_net SN4


set_scope Scope3
create_power_domain PD_Scope3 -include_scope
create_supply_port SP3_1
create_supply_net SP3_1
connect_supply_net SP3_1 -ports {SP3_1}
create_supply_port VSS
create_supply_net VSS
connect_supply_net VSS -ports {VSS}
create_supply_port SP4 -direction in
set_domain_supply_net PD_Scope3 -primary_power_net SP3_1 -primary_ground_net VSS
add_port_state SP3_1 -state {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {OFF off}
add_port_state SP4 -state {LV 0.6} -state {OFF off}
add_port_state VSS -state {OFF off}
create_pst pt3 -supplies {SP3_1 VSS}
add_pst_state S1 -pst pt3 -state {ON OFF}
add_pst_state S2 -pst pt3 -state {HV OFF}
add_pst_state S3 -pst pt3 -state {LV OFF}
add_pst_state S4 -pst pt3 -state {OFF OFF}
set_scope ..

set_scope Scope1
create_power_domain PD_Scope1 -include_scope
create_supply_port SP1_1
create_supply_net SP1_1
connect_supply_net SP1_1 -ports {SP1_1}
create_supply_port SP2_1
create_supply_port VSS
create_supply_net SN2_1
create_supply_net GN2
set_scope Scope1_1
create_power_domain PD_Scope1_1 -include_scope
create_supply_port SP2_1_1
create_supply_net SP2_1_1
connect_supply_net SP2_1_1 -ports {SP2_1_1}
create_supply_port VSS
create_supply_net VSS
connect_supply_net VSS -ports {VSS}
set_domain_supply_net PD_Scope1_1 -primary_power_net SP2_1_1 -primary_ground_net VSS
add_port_state SP2_1_1 -state {ON 1.2} -state {HV 1.0} -state {OFF off}
add_port_state VSS -state {OFF off}
create_pst pt1_1 -supplies {SP2_1_1 VSS}
add_pst_state S1 -pst pt1_1 -state {ON OFF}
add_pst_state S2 -pst pt1_1 -state {HV OFF}
add_pst_state S3 -pst pt1_1 -state {OFF OFF}
set_scope ..
connect_supply_net GN2 -ports {VSS Scope1_1/VSS}
connect_supply_net SN2_1 -ports {SP2_1 Scope1_1/SP2_1_1}
set_domain_supply_net PD_Scope1 -primary_power_net SP1_1 -primary_ground_net GN2
add_port_state SP1_1 -state {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {OFF off}
add_port_state SP2_1 -state {ON 1.2} -state {HV 1.0} -state {OFF off}
add_port_state VSS -state {OFF off}
create_pst pt1 -supplies {SP1_1 SN2_1 GN2}
add_pst_state S1 -pst pt1 -state {ON ON OFF}
add_pst_state S2 -pst pt1 -state {ON HV OFF}
add_pst_state S3 -pst pt1 -state {LV HV OFF}
add_pst_state S4 -pst pt1 -state {HV HV OFF}
add_pst_state S5 -pst pt1 -state {OFF ON OFF}
add_pst_state S6 -pst pt1 -state {OFF OFF OFF}
set_scope ..

set_scope Scope2
create_power_domain PD_Scope2 -include_scope
create_supply_port SP1_2
create_supply_net SP1_2
connect_supply_net SP1_2 -ports {SP1_2}
create_supply_port SP4_2 -direction in
create_supply_net SP4_2
connect_supply_net SP4_2 -ports {SP4_2}
create_supply_port VSS
create_supply_net VSS
connect_supply_net VSS -ports {VSS}
set_domain_supply_net PD_Scope2 -primary_power_net SP1_2 -primary_ground_net VSS
add_port_state VSS -state {OFF off}
add_port_state SP1_2 -state {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {OFF off}
add_port_state SP4_2 -state {LV 0.6} -state {OFF off}
create_pst pt2 -supplies {SP1_2 SP4_2 VSS}
add_pst_state S1 -pst pt2 -state {ON LV OFF}
add_pst_state S2 -pst pt2 -state {ON OFF OFF}
add_pst_state S3 -pst pt2 -state {HV LV OFF}
add_pst_state S4 -pst pt2 -state {LV LV OFF}
add_pst_state s5 -pst pt2 -state {OFF OFF OFF}
set_scope ..


connect_supply_net SN1 -ports {SP1 Scope1/SP1_1 Scope2/SP1_2}
connect_supply_net SN2 -ports {SP2 Scope1/SP2_1}
connect_supply_net GN1 -ports {VSS Scope1/VSS Scope2/VSS Scope3/VSS}
connect_supply_net SN3 -ports {SP3 Scope3/SP3_1}
connect_supply_net SN4 -ports {Scope3/SP4 Scope2/SP4_2}

set_domain_supply_net PD_TOP -primary_power_net SN1 -primary_ground_net GN1

add_port_state SP1 -state {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {OFF off}
add_port_state SP2 -state {ON 1.2} -state {HV 1.0} -state {OFF off}
add_port_state SP3 -state {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {OFF off}
add_port_state VSS -state {OFF off} -state {LV 0.6}

create_pst pt -supplies {SN1 SN2 SN3 GN1}
add_pst_state S1 -pst pt -state {ON ON ON OFF}
add_pst_state S2 -pst pt -state {HV ON LV OFF}
add_pst_state S3 -pst pt -state {LV HV LV LV}
add_pst_state S4 -pst pt -state {OFF OFF HV OFF}
add_pst_state S5 -pst pt -state {OFF OFF OFF OFF}
