create_power_domain PD_A -include_scope
create_supply_port A_P1
create_supply_net A_N1
create_supply_port A_P2
create_supply_net A_N2
create_supply_port A_P3
create_supply_net A_N3
create_supply_port A_P4
create_supply_net A_N4
create_supply_port A_P5
create_supply_net A_N5
create_supply_port A_P6
create_supply_net A_N6
create_supply_port A_P7
create_supply_net A_N7
create_supply_port A_P8
create_supply_net A_N8
add_port_state A_P1 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P2 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P3 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P4 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P5 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P6 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P7 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state A_P8 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
 
 
 
 
 
 
 
 
set_domain_supply_net PD_A -primary_power_net A_N1 -primary_ground_net A_N8
set_scope B
create_power_domain PD_B -include_scope
create_supply_port B_P1
create_supply_net B_N1
create_supply_port B_P2
create_supply_net B_N2
create_supply_port B_P3
create_supply_net B_N3
create_supply_port B_P4
create_supply_net B_N4
create_supply_port B_P5
create_supply_net B_N5
create_supply_port B_P6
create_supply_net B_N6
create_supply_port B_P7
create_supply_net B_N7
create_supply_port B_P8
create_supply_net B_N8
add_port_state B_P1 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P2 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P3 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P4 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P5 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P6 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P7 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state B_P8 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
connect_supply_net B_N1 -ports {B_P1}
connect_supply_net B_N2 -ports {B_P2}
connect_supply_net B_N3 -ports {B_P3}
connect_supply_net B_N4 -ports {B_P4}
connect_supply_net B_N5 -ports {B_P5}
connect_supply_net B_N6 -ports {B_P6}
connect_supply_net B_N7 -ports {B_P7}
connect_supply_net B_N8 -ports {B_P8}
create_pst pt_B -supplies {B_N1 B_N2 B_N3 B_N4 B_N5 B_N6 B_N7 B_N8 }
add_pst_state S1 -pst pt_B -state {LV UV LV OFF QV EV SV RV }
add_pst_state S2 -pst pt_B -state {EV ON OFF OFF ON YV IDEL ON }
add_pst_state S3 -pst pt_B -state {RV ACTIVE CV TV IDEL QV OFF TV }
add_pst_state S4 -pst pt_B -state {QV UV TV TV UV ON CV HV }
add_pst_state S5 -pst pt_B -state {UV WV EV QV RV LV RV CV }
add_pst_state S6 -pst pt_B -state {EV YV UV EV LV ACTIVE RV UV }
add_pst_state S7 -pst pt_B -state {OFF WV LV YV LV IDEL EV RV }
add_pst_state S8 -pst pt_B -state {RV UV ON EV UV CV TV CV }
add_pst_state S9 -pst pt_B -state {SV ON CV ACTIVE LV HV HV YV }
add_pst_state S10 -pst pt_B -state {SV WV WV RV IDEL TV HV CV }
add_pst_state S11 -pst pt_B -state {CV YV TV OFF EV UV ACTIVE CV }
add_pst_state S12 -pst pt_B -state {UV ACTIVE OFF IDEL HV IDEL LV HV }
add_pst_state S13 -pst pt_B -state {IDEL WV YV ON ACTIVE SV UV RV }
add_pst_state S14 -pst pt_B -state {OFF ON UV SV TV HV IDEL EV }
add_pst_state S15 -pst pt_B -state {ON HV ACTIVE EV HV QV QV QV }
add_pst_state S16 -pst pt_B -state {IDEL WV IDEL UV CV WV OFF TV }
add_pst_state S17 -pst pt_B -state {EV UV ACTIVE UV UV LV RV ON }
add_pst_state S18 -pst pt_B -state {EV EV SV UV ACTIVE YV EV RV }
add_pst_state S19 -pst pt_B -state {SV UV YV OFF UV CV WV ACTIVE }
add_pst_state S20 -pst pt_B -state {SV SV RV UV OFF TV LV LV }
add_pst_state S21 -pst pt_B -state {ACTIVE SV LV LV LV CV LV YV }
add_pst_state S22 -pst pt_B -state {QV LV YV YV QV ON WV SV }
add_pst_state S23 -pst pt_B -state {CV QV WV IDEL CV LV HV UV }
add_pst_state S24 -pst pt_B -state {EV YV YV LV HV QV SV CV }
add_pst_state S25 -pst pt_B -state {OFF TV EV QV EV OFF TV WV }
add_pst_state S26 -pst pt_B -state {OFF HV SV IDEL ACTIVE QV OFF ON }
add_pst_state S27 -pst pt_B -state {CV SV OFF RV QV TV WV HV }
add_pst_state S28 -pst pt_B -state {IDEL HV YV SV EV UV TV TV }
add_pst_state S29 -pst pt_B -state {LV UV TV YV OFF OFF SV WV }
add_pst_state S30 -pst pt_B -state {LV CV UV UV SV QV UV IDEL }
set_domain_supply_net PD_B -primary_power_net B_N1 -primary_ground_net B_N8
set_scope ..
set_scope C
create_power_domain PD_C -include_scope
create_supply_port C_P1
create_supply_net C_N1
create_supply_port C_P2
create_supply_net C_N2
create_supply_port C_P3
create_supply_net C_N3
create_supply_port C_P4
create_supply_net C_N4
create_supply_port C_P5
create_supply_net C_N5
create_supply_port C_P6
create_supply_net C_N6
create_supply_port C_P7
create_supply_net C_N7
create_supply_port C_P8
create_supply_net C_N8
add_port_state C_P1 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P2 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P3 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P4 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P5 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P6 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P7 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
add_port_state C_P8 -state  {ON 1.2} -state {HV 1.0} -state {LV 0.6} -state {ACTIVE 1.5} -state {IDEL 1.8} -state {CV 0.3} -state {SV 0.5} -state {OFF off} -state {QV 2.1} -state {WV 2.2} -state {EV 2.3} -state {RV 2.4} -state {TV 2.5} -state {YV 2.6} -state {UV 2.7}
connect_supply_net C_N1 -ports {C_P1}
connect_supply_net C_N2 -ports {C_P2}
connect_supply_net C_N3 -ports {C_P3}
connect_supply_net C_N4 -ports {C_P4}
connect_supply_net C_N5 -ports {C_P5}
connect_supply_net C_N6 -ports {C_P6}
connect_supply_net C_N7 -ports {C_P7}
connect_supply_net C_N8 -ports {C_P8}
create_pst pt_C -supplies {C_N1 C_N2 C_N3 C_N4 C_N5 C_N6 C_N7 C_N8 }
add_pst_state S1 -pst pt_C -state {ON HV OFF EV QV TV WV OFF }
add_pst_state S2 -pst pt_C -state {ON UV CV ON UV QV SV IDEL }
add_pst_state S3 -pst pt_C -state {QV OFF HV UV TV ACTIVE YV UV }
add_pst_state S4 -pst pt_C -state {HV LV LV IDEL RV HV LV ACTIVE }
add_pst_state S5 -pst pt_C -state {RV IDEL UV ACTIVE HV ON TV WV }
add_pst_state S6 -pst pt_C -state {UV ACTIVE WV IDEL ACTIVE QV EV TV }
add_pst_state S7 -pst pt_C -state {EV YV RV UV WV HV YV TV }
add_pst_state S8 -pst pt_C -state {IDEL QV WV WV EV TV IDEL CV }
add_pst_state S9 -pst pt_C -state {WV RV HV RV TV ON TV LV }
add_pst_state S10 -pst pt_C -state {RV CV WV ON ON RV TV HV }
add_pst_state S11 -pst pt_C -state {WV ON OFF ACTIVE HV UV QV ON }
add_pst_state S12 -pst pt_C -state {QV HV OFF EV CV CV WV OFF }
add_pst_state S13 -pst pt_C -state {HV LV ACTIVE CV EV HV EV CV }
add_pst_state S14 -pst pt_C -state {ON RV YV SV SV HV OFF WV }
add_pst_state S15 -pst pt_C -state {EV HV IDEL TV WV IDEL ACTIVE WV }
add_pst_state S16 -pst pt_C -state {UV IDEL RV IDEL LV TV YV YV }
add_pst_state S17 -pst pt_C -state {OFF EV ACTIVE RV TV CV EV ACTIVE }
add_pst_state S18 -pst pt_C -state {HV ON ACTIVE HV LV IDEL LV YV }
add_pst_state S19 -pst pt_C -state {QV QV HV WV YV SV LV TV }
add_pst_state S20 -pst pt_C -state {ACTIVE CV WV ON ACTIVE QV YV IDEL }
add_pst_state S21 -pst pt_C -state {LV WV QV SV OFF LV LV EV }
add_pst_state S22 -pst pt_C -state {ACTIVE SV ACTIVE UV YV SV ACTIVE YV }
add_pst_state S23 -pst pt_C -state {SV CV SV TV IDEL HV OFF HV }
add_pst_state S24 -pst pt_C -state {ON RV HV ACTIVE RV SV OFF CV }
add_pst_state S25 -pst pt_C -state {OFF TV EV QV EV OFF TV WV }
add_pst_state S26 -pst pt_C -state {OFF HV SV IDEL ACTIVE QV OFF ON }
add_pst_state S27 -pst pt_C -state {CV SV OFF RV QV TV WV HV }
add_pst_state S28 -pst pt_C -state {IDEL HV YV SV EV UV TV TV }
add_pst_state S29 -pst pt_C -state {LV UV TV YV OFF OFF SV WV }
add_pst_state S30 -pst pt_C -state {LV CV UV UV SV QV UV IDEL }
set_domain_supply_net PD_C -primary_power_net C_N1 -primary_ground_net C_N8
set_scope ..
connect_supply_net A_N1 -ports { A_P1 B/B_P1 C/C_P1}
connect_supply_net A_N2 -ports { A_P2 B/B_P2 C/C_P2}
connect_supply_net A_N3 -ports { A_P3 B/B_P3 C/C_P3}
connect_supply_net A_N4 -ports { A_P4 B/B_P4 C/C_P4}
connect_supply_net A_N5 -ports { A_P5 B/B_P5 C/C_P5}
connect_supply_net A_N6 -ports { A_P6 B/B_P6 C/C_P6}
connect_supply_net A_N7 -ports { A_P7 B/B_P7 C/C_P7}
connect_supply_net A_N8 -ports { A_P8 B/B_P8 C/C_P8}
create_pst pt_A -supplies {A_P1 A_P2 A_P3 A_P4 A_P5 A_P6 A_P7 A_P8 }
add_pst_state S1 -pst pt_A -state {ON QV OFF OFF IDEL RV LV HV }
add_pst_state S2 -pst pt_A -state {IDEL OFF OFF ON ON UV TV RV }
add_pst_state S3 -pst pt_A -state {IDEL OFF WV YV HV WV ON TV }
add_pst_state S4 -pst pt_A -state {ON UV TV UV UV LV IDEL SV }
add_pst_state S5 -pst pt_A -state {LV CV QV QV WV LV RV UV }
add_pst_state S6 -pst pt_A -state {ACTIVE TV ON RV LV ACTIVE SV OFF }
add_pst_state S7 -pst pt_A -state {CV WV UV ON EV UV YV HV }
add_pst_state S8 -pst pt_A -state {CV HV HV TV TV SV RV OFF }
add_pst_state S9 -pst pt_A -state {IDEL RV OFF ON UV ACTIVE UV EV }
add_pst_state S10 -pst pt_A -state {WV CV SV TV RV CV IDEL WV }
add_pst_state S11 -pst pt_A -state {SV TV OFF HV LV CV IDEL OFF }
add_pst_state S12 -pst pt_A -state {QV UV UV YV CV HV UV LV }
add_pst_state S13 -pst pt_A -state {UV ON LV YV IDEL EV WV CV }
add_pst_state S14 -pst pt_A -state {QV QV EV RV CV OFF IDEL UV }
add_pst_state S15 -pst pt_A -state {YV UV QV OFF IDEL YV EV UV }
add_pst_state S16 -pst pt_A -state {ACTIVE WV ACTIVE HV RV LV CV HV }
add_pst_state S17 -pst pt_A -state {EV WV OFF SV RV HV YV IDEL }
add_pst_state S18 -pst pt_A -state {HV WV OFF QV EV UV SV ON }
add_pst_state S19 -pst pt_A -state {YV QV QV LV CV LV WV RV }
add_pst_state S20 -pst pt_A -state {ACTIVE YV YV QV QV RV EV ACTIVE }
add_pst_state S21 -pst pt_A -state {YV LV LV WV TV HV CV UV }
add_pst_state S22 -pst pt_A -state {LV ON QV IDEL UV SV IDEL ACTIVE }
add_pst_state S23 -pst pt_A -state {ON IDEL UV UV OFF WV HV TV }
add_pst_state S24 -pst pt_A -state {UV SV TV ON ACTIVE QV RV HV }
add_pst_state S25 -pst pt_A -state {OFF TV EV QV EV OFF TV WV }
add_pst_state S26 -pst pt_A -state {OFF HV SV IDEL ACTIVE QV OFF ON }
add_pst_state S27 -pst pt_A -state {CV SV OFF RV QV TV WV HV }
add_pst_state S28 -pst pt_A -state {IDEL HV YV SV EV UV TV TV }
add_pst_state S29 -pst pt_A -state {LV UV TV YV OFF OFF SV WV }
add_pst_state S30 -pst pt_A -state {LV CV UV UV SV QV UV IDEL }
